import math


def area(r: (float | int)) -> float:
    '''
    Возвращает площадь круга по заданному радиусу.
    
    Параметры:
	r: (float | int) - целое значение либо значение с плавающей точкой.

    Возвращаемые параметры:
        Площадь круга с заданным радиусом r - float значение

    '''
    return math.pi * r * r


def perimeter(r: (float | int)) -> float: 
    '''
    Возвращает периметр круга по заданному радиусу

    Параметры:
    	r: (float | int) - целое значение либо значение с плавающей точкой

    Возвращаемые параметры:
	Периметр круга с заданным радиусом r - float значение
    '''
    return 2 * math.pi * r
