def area(a: (float | int), b: (float | int)) -> (float | int):
	'''
	Функция принимает на вход два значения целочисленного типа или с плавающей точкой - длины сторон прямоугольника.
	Функция возвращает площадь прямоугольника - целое значение или значение с плавающей точкой.

	Принимаемые параметры:
		a: (float | int) - длина первой стороны прямоугольника 
		b: (float | int) - длина второй стороны прямоугольника

	Возвращаемые параметры:
		Площадь прямоугольника a*b - float или int
	'''

	return a * b

def perimeter(a: (float | int), b: (float | int)) -> (float | int):
	'''
	Функция принимает на вход длины двух сторон прямоугольника и возвращает периметр прямоугольника.

	Принимаемые параметры:
		a: (float | int) - длина первой стороны прямоугольника
		b: (float | int) - длина второй стороны прямоугольника

	Возвращаемые параметры:
		Периметр прямоугольника 2*(a + b) - float или int значение
	'''

	return 2*(a + b)

