
def area(a: (int | float)) -> (int | float):
	'''
	Функция принимает на вход длину стороны квадрата - целочисленное значение или значение с плавающей точкой.
	Затем возвращает площадь квадрата с заданной длиной стороны.

	Принимаемые параметры:
		a: (float | int) - длина стороны квадрата.

	Возвращаемые параметры:
		Площадь квадрата - (float | int)
	'''

	return a * a


def perimeter(a: (int | float)) -> (int | float):
	'''
	Функция принимает на вход длину стороны квадрата целочисленного типа или типа с плавающей точкой.
	Затем функция возвращает периметр квадрата с заданной длиной стороны.

	Принимаемые параметры:
		a: (float | int) - длина стороны квадрата

	Возвращаемые параметры:
		Периметр квадрата - float или int значение
	'''
	return 4 * a
