def area(a: (float | int), h: (float | int)) -> (float | int):
	'''
	Функция принимает на вход длину основания треугольника и высоту, опущенную на это основание - значения целочисленного типа или типа с плавающей точкой.
	Затем функция возвращает площадь треугольника.

	Принимаемые параметры:
		a: (float | int) - длина основания треугольника
		h: (float | int) - высота, проведённая к основанию a

	Возвращаемые параметры:
		Площадь треугольника a*h/2 - float или int значение
	'''

	return a * h / 2

def perimeter(a: (float | int), b: (float | int), c: (float | int)) -> (float | int):
	'''
	Функция принимает на вход длины трёх сторон треугольника и возвращает периметр треугольника.

	Принимаемые параметры:
		a: (float | int) - длина первой стороны треугольника
		b: (float | int) - длина второй стороны треугольника
		c: (float | int) - длина третьей стороны треугольника

	Возвращаемые параметры:
		Периметр треугольника a + b + c - float или int значение
	'''

	return a + b + c

